app/Http/Controllers/PostController.php

select * from `posts` where `posts`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `posts` where `posts`.`deleted_at` is null
---
    public function index()
    {
        $posts = Post::paginate(10);